import LadderImg from '../assets/img/ladder.png'
export const questionnaireData = {
  "title": "大五人格特质测验",
  "introduction": `<p style="font-size:14px;text-indent:2em;">本量表是国际通行的规范人格测验和相关信息，对个人隐私信息会按照国家统计法严格保密。</p><br><p style="font-size:14px;text-indent:2em;">结果会呈现您的大五人格得分。</p>`,
  "page": [
    [{
      "title": "下面有44个短语，都是对一个人特点的描述，请你根据每个描述与你多数情况下的自己相符合的程度进行选择。",
      "type": "matrix-radio",
      "choice": [{
        "title": "非常不同意",
        "value": 1
      }, {
        "title": "有点不同意",
        "value": 2
      }, {
        "title": "中立",
        "value": 3
      }, {
        "title": "有点同意",
        "value": 4
      }, {
        "title": "非常同意",
        "value": 5
      }],
      "subquestion": [{
        "title": "爱说话",
        "value": "A201"
      }, {
        "title": "喜欢挑剔别人的毛病",
        "value": "A202"
      }, {
        "title": "工作很周密",
        "value": "A203"
      }, {
        "title": "压抑而忧",
        "value": "A204"
      }, {
        "title": "具创造性，总有新点",
        "value": "A205"
      }, {
        "title": "含蓄的",
        "value": "A206"
      }, {
        "title": "乐于助人，无私",
        "value": "A207"
      }, {
        "title": "有些粗心",
        "value": "A208"
      }, {
        "title": "放松的，可以很好应对压",
        "value": "A209"
      }, {
        "title": "对许多不同的事情感到好奇",
        "value": "A210"
      }, {
        "title": "精力充沛",
        "value": "A211"
      }, {
        "title": "经常与他人发生争吵",
        "value": "A212"
      }, {
        "title": "是个可信赖的人",
        "value": "A213"
      }, {
        "title": "有时会紧张",
        "value": "A214"
      }, {
        "title": "是一个有独到且深刻见解的思考",
        "value": "A215"
      }, {
        "title": "充满热情",
        "value": "A216"
      }, {
        "title": "宽大包容",
        "value": "A217"
      }, {
        "title": "没什么条理",
        "value": "A218"
      }, {
        "title": "担心各种事情",
        "value": "A219"
      }, {
        "title": "想象力活跃",
        "value": "A220"
      }, {
        "title": "比较安静",
        "value": "A221"
      }, {
        "title": "信任他人",
        "value": "A222"
      }, {
        "title": "比较懒惰",
        "value": "A223"
      }, {
        "title": "情绪稳定，不容易焦躁",
        "value": "A224"
      }, {
        "title": "善于创造",
        "value": "A225"
      }, {
        "title": "性格决断",
        "value": "A226"
      }, {
        "title": "可能会冷淡孤僻",
        "value": "A227"
      }, {
        "title": "坚持不懈，直到任务完成",
        "value": "A228"
      }, {
        "title": "情绪化",
        "value": "A229"
      }, {
        "title": "重视艺术和审美体验",
        "value": "A230"
      }, {
        "title": "有时羞怯、拘谨",
        "value": "A231"
      }, {
        "title": "几乎对每个人都很友善及体谅",
        "value": "A232"
      }, {
        "title": "做事有效率",
        "value": "A233"
      }, {
        "title": "在紧张情境中仍保持冷静",
        "value": "A234"
      }, {
        "title": "喜欢从事常规性的工作，不喜欢不确定性",
        "value": "A235"
      }, {
        "title": "开朗好交际",
        "value": "A236"
      }, {
        "title": "有时候粗鲁无礼",
        "value": "A237"
      }, {
        "title": "能够制定计划并加以贯彻",
        "value": "A238"
      }, {
        "title": "容易紧张",
        "value": "A239"
      }, {
        "title": "喜欢思考",
        "value": "A240"
      }, {
        "title": "没什么艺术兴趣",
        "value": "A241"
      }, {
        "title": "喜欢与他人合作，而不是竞争",
        "value": "A242"
      }, {
        "title": "容易分心",
        "value": "A243"
      }, {
        "title": "精通艺术美术、音乐或文学",
        "value": "A244"
      }]
    }],
    [{
      "title": "有文章称，手机中的高频蓝光大大增加了眼睛疾病的风险，会导致眼睛失明大量出现。这可信吗？",
      "type": "radio",
      "choice": [{
        "title": "不可信，蓝光对眼睛没有任何危害，因此也不存在导致眼睛失明的情况。",
        "value": 1
      }, {
        "title": "不可信，蓝光虽然对人眼有一定伤害，但说是“失明”就太夸张了。",
        "value": 2
      }, {
        "title": "可信，因为市面上就有很多防蓝光膜、电脑辐射防护眼镜，如果蓝光没有害处，为什么会有这些产品。",
        "value": 3
      }, {
        "title": "可信，这是世界卫生组织WHO爱眼协会发布的蓝光危害人类的橙色预警。",
        "value": 4
      }]
    }, {
      "title": "性命攸关的时刻，用一根缝衣针放血就能救命。这可信吗？",
      "type": "radio",
      "choice": [{
        "title": "关键时刻救命可能不行，但平时偶尔放血有利于身体健康。",
        "value": 1
      }, {
        "title": "民间流传多年的“急救妙招”可以相信。",
        "value": 2
      }, {
        "title": "“扎针放血救命”的方法只能用在半身不遂、心脏病、哮喘上，别的不行。",
        "value": 3
      }, {
        "title": "针刺放血治疗缺乏科学道理，不能盲目相信。",
        "value": 4
      }]
    }, {
      "title": "一位果农爆料，无核葡萄是用避孕药培育的，您认为这个说法可信吗？",
      "type": "radio",
      "choice": [{
        "title": "这种说法是果农自己的爆料，肯定可信。",
        "value": 1
      }, {
        "title": "有可能，现在商家为了让水果好卖打了各种各样的农药，用“避孕药”也有可能。",
        "value": 2
      }, {
        "title": "避孕药能植物动物通用么？感觉这个说法不太靠谱。",
        "value": 3
      }, {
        "title": "人吃避孕药会影响自身激素分泌，植物用避孕药应该也会有类似的作用，影响激素分泌，让果实没有籽。",
        "value": 4
      }]
    }, {
      "title": "“中国每年60万人过劳死”，这是真的吗？",
      "type": "radio",
      "choice": [{
        "title": "这个数据太可怕了，宝宝感觉身体被掏空。",
        "value": 1
      }, {
        "title": "是真的，而且中国已经超过日本成为过劳死第一大国。",
        "value": 2
      }, {
        "title": "我在媒体上看到过这个报道，媒体报道应该是真的。",
        "value": 3
      }, {
        "title": "不太可能吧，感觉这个数据太夸张了。",
        "value": 4
      }]
    }, {
      "title": "钟南山院士称“每年210万儿童死于豪华装修”，这个说法可信吗？",
      "type": "radio",
      "choice": [{
        "title": "真的有这么多儿童死亡？我不太相信。",
        "value": 1
      }, {
        "title": "权威院士亲口说的，应该是真的。",
        "value": 2
      }, {
        "title": "早就听说过装修的有毒物质多，没想到这么恐怖。",
        "value": 3
      }]
    }],
    [{
      "title": "性别",
      "type": "radio",
      "choice": [{
        "title": "男",
        "value": 1
      }, {
        "title": "女",
        "value": 2
      }]
    }, {
      "title": "年龄",
      "type": "datetime"
    }, {
      "title": "户口类型",
      "type": "radio",
      "choice": [{
        "title": "城镇",
        "value": 1
      }, {
        "title": "农村",
        "value": 2
      }]
    }, {
      "title": "最高学历",
      "type": "radio",
      "choice": [{
        "title": "小学及以下",
        "value": 1
      }, {
        "title": "初中",
        "value": 2
      }, {
        "title": "中专或职高",
        "value": 3
      }, {
        "title": "高中",
        "value": 4
      }, {
        "title": "大专",
        "value": 5
      }, {
        "title": "大学本科（含在读）",
        "value": 6
      }, {
        "title": "硕士（含在读）",
        "value": 7
      }, {
        "title": "博士（含在读）",
        "value": 8
      }]
    }, {
      "title": "婚姻状况",
      "type": "radio",
      "choice": [{
        "title": "未婚",
        "value": 1
      }, {
        "title": "已婚",
        "value": 2
      }, {
        "title": "离异",
        "value": 3
      }, {
        "title": "其他",
        "value": 4
      }]
    }, {
      "title": "您的职业是",
      "type": "radio",
      "choice": [{
        "title": "党政军体制内工作者（例如，公务员、军人）",
        "value": 1
      }, {
        "title": "专业技术人员（例如，大学老师、律师、医生、记者）",
        "value": 2
      }, {
        "title": "商业管理人士（例如，企业高管、民营企业家）",
        "value": 3
      }, {
        "title": "普通公司职工（例如，蓝白领、公司普通员工）",
        "value": 4
      }, {
        "title": "服务行业从业者（例如，司机、农民工）",
        "value": 5
      }, {
        "title": "个体户或自由职业者（例如，小商店店主、商贩）",
        "value": 6
      }, {
        "title": "农民",
        "value": 7
      }, {
        "title": "学生",
        "value": 8
      }, {
        "title": "其他",
        "value": 9
      }]
    }, {
      "title": "您的家庭每月总收入",
      "type": "radio",
      "choice": [{
        "title": "2000元及以下",
        "value": 1
      }, {
        "title": "2000-6000元",
        "value": 2
      }, {
        "title": "6001-1万元",
        "value": 3
      }, {
        "title": "1万以上-1.5万元",
        "value": 4
      }, {
        "title": "1.5万以上-3万元",
        "value": 5
      }, {
        "title": "3万以上-4.5万元",
        "value": 6
      }, {
        "title": "4.5万以上-6万元",
        "value": 7
      }, {
        "title": "6万元以上",
        "value": 8
      }]
    }, {
      "title": "您的家庭成员包括：（可多选）",
      "type": "checkbox",
      "choice": [{
        "title": "祖父",
        "value": 1
      }, {
        "title": "祖母",
        "value": 2
      }, {
        "title": "父亲",
        "value": 3
      }, {
        "title": "母亲",
        "value": 4
      }, {
        "title": "配偶",
        "value": 5
      }, {
        "title": "儿子",
        "value": 6
      }, {
        "title": "女儿",
        "value": 7
      }, {
        "title": "兄弟",
        "value": 8
      }, {
        "title": "姐妹",
        "value": 9
      }, {
        "title": "其它",
        "value": 10
      }]
    }, {
      "title": "在我们社会里，有些群体居于顶层，有些群体则处于底层。左边是一个梯子图。“10”代表最顶层，“1”代表最底层。您认为您现在处在第__________层？（请选择1-10之间的具体数字）",
      "detail": `<img src="${LadderImg}"/>`,
      "type": "picker",
      "list": [
        ['1', '2', '3', '4', '5', '6', '7', '8', '9', '10']
      ]
    }, {
      "title": "总的来说您的幸福程度如何？ ",
      "type": "radio",
      "choice": [{
        "title": "非常不幸福",
        "value": 1
      }, {
        "title": "比较不幸福",
        "value": 2
      }, {
        "title": "一般",
        "value": 3
      }, {
        "title": "比较幸福",
        "value": 4
      }, {
        "title": "非常幸福",
        "value": 5
      }]
    }, {
      "title": "过去一年中，你是否有以下活动？（可多选） ",
      "type": "checkbox",
      "choice": [{
        "title": "吸烟",
        "value": 1
      }, {
        "title": "酗酒",
        "value": 2
      }, {
        "title": "健身",
        "value": 3
      }, {
        "title": "定期体检",
        "value": 4
      }, {
        "title": "减肥",
        "value": 5
      }, {
        "title": "跑马拉松",
        "value": 6
      }]
    }, {
      "title": "您平均每天的睡眠时间有多少小时？",
      "type": "picker",
      "list": [
        [1, 1.5, 2, 2.5, 3, 3.5, 4, 4.5, 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 10.5, 11, 11.5, 12, 12.5, 13, 13.5, 14, 14.5, 15]
      ],
      "defaultSelectedValue": ["7"]
    }, {
      "title": "您平均每天的上网（非工作）时间有多少小时？",
      "type": "picker",
      "list": [
        [1, 1.5, 2, 2.5, 3, 3.5, 4, 4.5, 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 10.5, 11, 11.5, 12, 12.5, 13, 13.5, 14, 14.5, 15]
      ],
      "defaultSelectedValue": ["7"]
    }, {
      "title": "您出生或主要成长的地方是？",
      "type": "address"
    }, {
      "title": "您在出生或主要成长地方居住了大约多少年？",
      "type": "picker",
      "list": [
        ['1年以下', '1年', '2年', '3年', '4年', '5年', '6年', '7年', '8年', '9年', '10年', '10年以上']
      ]
    }, {
      "title": "您现在的常住地是？",
      "type": "address"
    }, {
      "title": "您在现在的常住地居住了多少年？",
      "type": "picker",
      "list": [
        ['1年以下', '1年', '2年', '3年', '4年', '5年', '6年', '7年', '8年', '9年', '10年', '10年以上']
      ]
    }, {
      "title": "您在城市拥有几套房产？",
      "type": "radio",
      "choice": [{
        "title": "0套",
        "value": 1
      }, {
        "title": "1套",
        "value": 2
      }, {
        "title": "2套",
        "value": 3
      }, {
        "title": "3套以上",
        "value": 4
      }]
    }]
  ]
}

export const characterData = {
  // 维度1：Openness
  // 维度2：Conscientiousness
  // 维度3：Extraversion
  // 维度4：Agreeableness
  // 维度5：Neuroticism
  introduction: '大五人格模型是应用最为广泛的测量人们性格特点的心理学工具。它们分别是：开放性(Openness)、尽责性(Conscientiousness)、外倾性(Extraversion)、宜人性(Agreeableness)、神经质(Neuroticism)，可简记为OCEAN即“大海”模型。',
  dimension: [{
    name: 'Openness',
    chinese: '开放型',
    introduction: '主要反映人们对创新、新异事物的偏好程度。开放性高的人，更加具有创造性、想象力、兴趣广泛，开放性低的人比较传统、保守、偏爱常规。',
    highDescription: '具有创造性、想象力、兴趣广泛',
    lowDescription: '比较传统、保守、偏爱常规',
    score: 0,
    rank: 0,
    alg: [5, 10, 15, 20, 25, 30, -35, 40, -41, 44],
    scoreTable: [0.2917, 0.3333, 0.3750, 0.3958, 0.3958, 0.4167, 0.4375, 0.4375, 0.4583, 0.4583, 0.4583, 0.4792, 0.4792, 0.4792, 0.5000, 0.5000, 0.5000, 0.5208, 0.5208, 0.5208, 0.5208, 0.5417, 0.5417, 0.5417, 0.5417, 0.5625, 0.5625, 0.5625, 0.5625, 0.5625, 0.5833, 0.5833, 0.5833, 0.5833, 0.5833, 0.6042, 0.6042, 0.6042, 0.6042, 0.6042, 0.6042, 0.6250, 0.6250, 0.6250, 0.6250, 0.6250, 0.6458, 0.6458, 0.6458, 0.6458, 0.6458, 0.6667, 0.6667, 0.6667, 0.6667, 0.6667, 0.6667, 0.6875, 0.6875, 0.6875, 0.6875, 0.6875, 0.7083, 0.7083, 0.7083, 0.7083, 0.7083, 0.7292, 0.7292, 0.7292, 0.7292, 0.7500, 0.7500, 0.7500, 0.7500, 0.7500, 0.7708, 0.7708, 0.7708, 0.7917, 0.7917, 0.7917, 0.7917, 0.8125, 0.8125, 0.8125, 0.8333, 0.8333, 0.8333, 0.8542, 0.8542, 0.8750, 0.8750, 0.8958, 0.8958, 0.9167, 0.9375, 0.9583, 0.9792]
  }, {
    name: 'Conscientiousness',
    chinese: '尽责型',
    introduction: '主要反映人们的责任性、纪律性等特征。高尽责性的人一般工作细致，低尽责性的人相对粗心和马虎。',
    highDescription: '工作细致',
    lowDescription: '相对粗心和马虎',
    score: 0,
    rank: 0,
    alg: [3, -8, 13, -18, -23, 28, 33, 38, -43],
    scoreTable: [0.3333, 0.3750, 0.3958, 0.4167, 0.4583, 0.4613, 0.4792, 0.5000, 0.5000, 0.5208, 0.5208, 0.5417, 0.5417, 0.5417, 0.5625, 0.5625, 0.5625, 0.5625, 0.5833, 0.5833, 0.5833, 0.5833, 0.6042, 0.6042, 0.6042, 0.6042, 0.6250, 0.6250, 0.6250, 0.6250, 0.6250, 0.6458, 0.6458, 0.6458, 0.6458, 0.6458, 0.6667, 0.6667, 0.6667, 0.6667, 0.6667, 0.6875, 0.6875, 0.6875, 0.6875, 0.6875, 0.7083, 0.7083, 0.7083, 0.7083, 0.7083, 0.7083, 0.7292, 0.7292, 0.7292, 0.7292, 0.7292, 0.7500, 0.7500, 0.7500, 0.7500, 0.7500, 0.7708, 0.7708, 0.7708, 0.7708, 0.7708, 0.7708, 0.7917, 0.7917, 0.7917, 0.7917, 0.7917, 0.8125, 0.8125, 0.8125, 0.8125, 0.8333, 0.8333, 0.8333, 0.8333, 0.8542, 0.8542, 0.8542, 0.8542, 0.8613, 0.8750, 0.8750, 0.8750, 0.8958, 0.8958, 0.8958, 0.9167, 0.9167, 0.9375, 0.9375, 0.9583, 0.9712, 1.0000]
  }, {
    name: 'Extraversion',
    chinese: '外倾型',
    introduction: '主要反映人们精神充沛、爱好社交的程度。外倾性高的人自信、爱说话、喜欢社交，外倾性低的人则比较内向、不善言谈。',
    highDescription: '自信、爱说话、喜欢社交',
    lowDescription: '比较内向、不善言谈',
    score: 0,
    rank: 0,
    alg: [1, -6, 11, 16, -21, 26, -31, 36],
    scoreTable: [0.2500, 0.2708, 0.2917, 0.3125, 0.3333, 0.3333, 0.3542, 0.3750, 0.3750, 0.3750, 0.3958, 0.3958, 0.3958, 0.4167, 0.4167, 0.4375, 0.4375, 0.4375, 0.4375, 0.4583, 0.4583, 0.4583, 0.4583, 0.4792, 0.4792, 0.4792, 0.4792, 0.5000, 0.5000, 0.5000, 0.5000, 0.5000, 0.5208, 0.5208, 0.5208, 0.5208, 0.5208, 0.5417, 0.5417, 0.5417, 0.5417, 0.5417, 0.5625, 0.5625, 0.5625, 0.5625, 0.5625, 0.5833, 0.5833, 0.5833, 0.5833, 0.5833, 0.6042, 0.6042, 0.6042, 0.6042, 0.6042, 0.6250, 0.6250, 0.6250, 0.6250, 0.6250, 0.6458, 0.6458, 0.6458, 0.6458, 0.6458, 0.6667, 0.6667, 0.6667, 0.6667, 0.6875, 0.6875, 0.6875, 0.6875, 0.7083, 0.7083, 0.7083, 0.7083, 0.7292, 0.7292, 0.7292, 0.7500, 0.7500, 0.7500, 0.7708, 0.7708, 0.7708, 0.7917, 0.7917, 0.8125, 0.8125, 0.8333, 0.8542, 0.8542, 0.8750, 0.8958, 0.9167, 0.9583]
  }, {
    name: 'Agreeableness',
    chinese: '宜人型',
    introduction: '指人们对他人的热情、友善态度。高宜人性的人更加友好、善解人意、对人性持乐观态度，低宜人性的人则相对多疑、对他人相对苛刻。',
    highDescription: '友好、善解人意、对人性持乐观态度',
    lowDescription: '相对多疑、对他人相对苛刻',
    score: 0,
    rank: 0,
    alg: [-2, 7, -12, 17, 22, -27, 32, -37, 42],
    scoreTable: [0.3333, 0.3958, 0.4375, 0.4583, 0.4792, 0.5000, 0.5000, 0.5208, 0.5417, 0.5417, 0.5435, 0.5625, 0.5625, 0.5833, 0.5833, 0.5833, 0.6042, 0.6042, 0.6042, 0.6042, 0.6250, 0.6250, 0.6250, 0.6250, 0.6458, 0.6458, 0.6458, 0.6458, 0.6458, 0.6667, 0.6667, 0.6667, 0.6667, 0.6667, 0.6875, 0.6875, 0.6875, 0.6875, 0.6875, 0.6875, 0.7083, 0.7083, 0.7083, 0.7083, 0.7083, 0.7083, 0.7292, 0.7292, 0.7292, 0.7292, 0.7292, 0.7292, 0.7500, 0.7500, 0.7500, 0.7500, 0.7500, 0.7500, 0.7708, 0.7708, 0.7708, 0.7708, 0.7708, 0.7917, 0.7917, 0.7917, 0.7917, 0.7917, 0.7917, 0.8125, 0.8125, 0.8125, 0.8125, 0.8125, 0.8333, 0.8333, 0.8333, 0.8333, 0.8333, 0.8542, 0.8542, 0.8542, 0.8542, 0.8750, 0.8750, 0.8750, 0.8750, 0.8958, 0.8958, 0.8958, 0.9167, 0.9167, 0.9167, 0.9375, 0.9375, 0.9583, 0.9583, 0.9792, 1.0000]
  }, {
    name: 'Neuroticism',
    chinese: '神经质型',
    introduction: '主要反映人们体验消极情绪的倾向。神经质高的人更容易体验焦虑、抑郁等消极情绪，神经质低的人则比较平静、放松。',
    highDescription: '容易体验焦虑、抑郁等消极情绪',
    lowDescription: '比较平静、放松',
    score: 0,
    rank: 0,
    alg: [4, -9, 14, 19, -24, 29, -34, 39],
    scoreTable: [0.1875, 0.2292, 0.2500, 0.2708, 0.2708, 0.2917, 0.3125, 0.3125, 0.3333, 0.3333, 0.3542, 0.3542, 0.3750, 0.3750, 0.3750, 0.3958, 0.3958, 0.3958, 0.4167, 0.4167, 0.4375, 0.4375, 0.4375, 0.4375, 0.4583, 0.4583, 0.4583, 0.4583, 0.4792, 0.4792, 0.4792, 0.4792, 0.5000, 0.5000, 0.5000, 0.5208, 0.5208, 0.5208, 0.5208, 0.5208, 0.5417, 0.5417, 0.5417, 0.5417, 0.5625, 0.5625, 0.5625, 0.5625, 0.5625, 0.5833, 0.5833, 0.5833, 0.5833, 0.6042, 0.6042, 0.6042, 0.6042, 0.6042, 0.6250, 0.6250, 0.6250, 0.6250, 0.6458, 0.6458, 0.6458, 0.6458, 0.6667, 0.6667, 0.6667, 0.6667, 0.6875, 0.6875, 0.6875, 0.6875, 0.7083, 0.7083, 0.7083, 0.7083, 0.7292, 0.7292, 0.7292, 0.7500, 0.7500, 0.7708, 0.7708, 0.7708, 0.7917, 0.7917, 0.8125, 0.8125, 0.8333, 0.8333, 0.8542, 0.8542, 0.8750, 0.8958, 0.8958, 0.9167, 0.9375]
  }],
  calculateScore(scores) {
    const alg = this.dimension.map(item => item.alg);
    const dimension = alg.length;
    let result = [];
    for (let i = 0; i < dimension; i++) {
      let column = alg[i].length;
      let score = 0;
      for (let j = 0; j < column; j++) {
        let index;
        if (alg[i][j] > 0) {
          index = alg[i][j] - 1;
          score += parseInt(scores[index], 10);
        } else {
          index = -alg[i][j] - 1;
          score += (6 - parseInt(scores[index], 10));
        }
      }
      this.dimension[i].score = result[i] = (score / column / dimension);
    }
    return result;
  },
  calculateRank(scores) {
    this.calculateScore(scores);
    let score = this.dimension.map(item => item.score);
    let scoreTable = this.dimension.map(item => item.scoreTable);
    let result = [];
    for(let i = 0, dimension = score.length; i < dimension; i++) {
      if(score[i] > scoreTable[i].slice(-1)) {
        this.dimension[i].rank = result[i] = 100;
      } else {
        for(let j = scoreTable[i].length - 2; j >= 0; j--) {
          if(score[i] > scoreTable[i][j] && score[i] <= scoreTable[i][j + 1]) {
            this.dimension[i].rank = result[i] = j + 2;
            break;
          }
          this.dimension[i].rank = result[i] = 1;
        }
      }
    }
    return result;
  },
  getCharacter() {
    // 反馈模板：你属于高A型或低B型人格，你可能：balabala
    // 选择高A或低B的办法，可以分别计算每个维度的离群值（离群值=某维度人群排位 - 50），离群值绝对值越大的维度则优先入选，并且如果离群值为正，即为高A型人格；如果离群值为负，则为低A型人格。如果有两个或以上维度的离群值相等，则同时入选，并列列出即可。
    // 注意：如果所有维度的离群值都小于等于10，即排位都在40-60之间，就反馈说:你属于大众人格，所有维度都处于人群的平均水平。
    let data = this.dimension.map(({chinese, rank, highDescription, lowDescription}) => {
      return {
        chinese,
        rank,
        highDescription,
        lowDescription
      };
    });
    if(data.filter(item => item.rank < 40 || item.rank > 60).length === 0) {
      return `你属于大众人格，所有维度都处于人群的平均水平`;
    } else {
      let characterArr = [];
      let descriptionArr = [];
      let temp = data.sort((a, b) => a.rank - b.rank); // 从小到大
      let lowData = temp[0];
      let highData = temp.slice(-1)[0];
      if(highData.rank > 50) {
        let allData = temp.filter(item => item.rank === highData.rank);
        characterArr.push(allData.map(item => '高' + item.chinese).join('+'));
        descriptionArr.push(allData.map(item => item.highDescription).join('，'));
      }
      if(lowData.rank < 50) {
        let allData = temp.filter(item => item.rank === lowData.rank);
        characterArr.push(allData.map(item => '低' + item.chinese).join('+'));
        descriptionArr.push(allData.map(item => item.lowDescription).join('，'));
      }
      return `您属于${characterArr.join('或')}</span>人格，您可能：${descriptionArr.join('，')}。`;
    }
  }
}
